
### :robot: Terraform Report
---
##### Plan: `4` to add, `0` to change, `1` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_container_cluster.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_cluster" "primary" {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + binary_authorization              = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + dns_config                        = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "europe-central2"
      + logging_config                    = (known after apply)
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + mesh_certificates                 = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_config                 = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = "scrap-masters"
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + project                           = "scrapmasters"
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + self_link                         = (known after apply)
      + service_external_ips_config       = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/16" -> (known after apply)
      + datapath_provider           = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      ~ endpoint                    = "34.118.0.100" -> (known after apply)
      ~ id                          = "projects/scrapmasters/locations/europe-central2-a/clusters/scrap-masters" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.22.12-gke.2300" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "scrap-masters"
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.22.12-gke.2300" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "scrapmasters" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1beta1/projects/scrapmasters/zones/europe-central2-a/clusters/scrap-masters" -> (known after apply)
      ~ services_ipv4_cidr          = "10.1.0.0/20" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (13 unchanged attributes hidden)

      ~ addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          ~ gce_persistent_disk_csi_driver_config {
              ~ enabled = true -> (known after apply)
            }

          + gke_backup_agent_config {
              + enabled = (known after apply)
            }

          ~ istio_config {
                # (1 unchanged attribute hidden)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          ~ network_policy_config {
              ~ disabled = true -> (known after apply)
            }

            # (4 unchanged blocks hidden)
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      - binary_authorization {
          - enabled = false -> null
        }

      ~ cluster_autoscaling {
          ~ autoscaling_profile = "BALANCED" -> (known after apply)
          ~ enabled             = false -> (known after apply)

          + auto_provisioning_defaults {
              + boot_disk_kms_key = (known after apply)
              + image_type        = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + service_account   = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      ~ cluster_telemetry {
          ~ type = "ENABLED" -> (known after apply)
        }

      + cost_management_config {
          + enabled = (known after apply)
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ default_snat_status {
          ~ disabled = false -> (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      ~ ip_allocation_policy {
          ~ cluster_secondary_range_name  = "gke-scrap-masters-pods-31a06afa" -> (known after apply)
          ~ services_secondary_range_name = "gke-scrap-masters-services-31a06afa" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ logging_config {
          ~ enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> (known after apply)
        }

      ~ maintenance_policy {
          ~ daily_maintenance_window {
              ~ duration   = "PT4H0M0S" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUxQekNCQVQzL1JPQXNEVjY3Mm43WXd3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1lqazBaV1U1WXpVdFlqazBPUzAwTkROa0xUazFaV0V0WVdFMVpURmpNamN6T1RSaApNQ0FYRFRJeU1UQXhOakV4TkRrek5Wb1lEekl3TlRJeE1EQTRNVEkwT1RNMVdqQXZNUzB3S3dZRFZRUURFeVJpCk9UUmxaVGxqTlMxaU9UUTVMVFEwTTJRdE9UVmxZUzFoWVRWbE1XTXlOek01TkdFd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEQjNONisxU2phZTNxendIbU5HRWlzYnd5ZUEvQ0JMWXJ1UjVzMAphMW40ZjJmZ20zQVdRbGZ1ZjFxRU1hd1QxbG9ZRWdxdmdLMGdEaW41WDc5bExDTFowbkVnbmlEekpzdkNETUtmClYyS2F3T3ZXYUp5bjVpcmlIaTBRbnlTZng1bFpiQkw0ZEFack13NGM3TkRhZDJHYkpQR2t3NXFUQUtDYnVvQmQKRnVDYjBJOHJpMlNxTThtWTUzMUtxZ3p5ZFpzOFFxUEFKZEVnSFN3dTB4eDhJYnV2RGRmRHFJODRvYVRhUEEwVApOSXNRSjA3blEzQ2lPL1UzNzhwTDFTWE5lZlBFWTU1b2Y2a0Fqckt3NVZ5S0VwNG1lR1hBWFFCYUJham4zdnJQCjJMc3pYYnRxSE9BMlg1bXE2SE5DZnkzZGpINGhlZnZKK25zZDhjOW44enNHTVMvNVIwcXF2Y2wzcEZUbzEvSlUKdWhLcTc4YVpjSXJZWis1MXRXbDdsTTY5QlY0Ymc4RkRCRnAzbis0Z05GT3J6K0VWd2E5ZHUweDAzREVWOGN6cwpXby8rM3hHaXZmcnhUYWVEZTFXUy83UzM2bmJLaDczMDlJNGVQRzZ6SDVzcHQ1S0RDT1BJMk90c3hwZFlyRUZxCkRNTkNJRE1XSkFmUENqYzU0NS9SSTE1RmJDMENBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGRlFqd1prYit1dkxBeXhjVkkwSFZJQlhSZmJXTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQ3Vkc0s2RFdaOHZqQzNsc3U2WHIyUlMwMm1NeUNIbnp5eEFxMTdXZW9aClV6K01RTFVkS0Z5bWIyY0txbTI4ZzVpZzVrRmdxeTEyZHdGdVVYTzFLOFhCa0s1djA1NDIvZDBFUFE0L3ZFZWQKR1hDTVk4d2RBSDJxbExMVFJMbVVwZmRydFV2clNLeUdvcFlZbHZncmxXRGdOaEx0dmFISnBZSEhSWHVheTlUSApnZWoycEtmY0dCR1pnTGRxS2RXTGhReXduZXRielVQWFB4OE53OVVYU0Y0c1RrVHVyWm9jYmJQdWpPT1RuSmluClpsanFhbW4rZzlRTzlEbnFMUE9ZNGRmUzc1dHNGRUNyWFB3bEVHWG5Uem11WEFla3dCRG1vNVlYd1lBWTRJckIKQk5oVEg5OXliaTJ3MisyRW8wVnQ4dmVZZ3JjbHBjWGNWZWZObHNxZ1hwQldreTFXUWVMcUp0NkZ5WDZDNjF0VgpReHpmbGs2c095QnZDUHlZNDd4SUtsUzlLT1l2TXd1azRIeDJLUk9ZOVhURnhYcUl1ajlIY0RVb3ZIc0hyeUxVCnJlVW5WOHNvZlQ0SkwzOS9XNjBHL0hOUFRNaUFST1ByRnJjc3czSWROWXo2amhIck40OUp3SjM5ODF1cVlXN28KaFNpUThzN3J2Y29SY1ZjcFpIZHZybnc9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

          ~ client_certificate_config {
              ~ issue_client_certificate = false -> (known after apply)
            }
        }

      + mesh_certificates {
          + enable_certificates = (known after apply)
        }

      ~ monitoring_config {
          ~ enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> (known after apply)

          + managed_prometheus {
              + enabled = (known after apply)
            }
        }

      ~ network_policy {
          - provider = "PROVIDER_UNSPECIFIED" -> null
            # (1 unchanged attribute hidden)
        }

      ~ node_config {
          ~ disk_size_gb      = 40 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          ~ workload_metadata_config {
              ~ mode = "GKE_METADATA" -> (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count          = 1 -> (known after apply)
          ~ instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/scrapmasters/zones/europe-central2-a/instanceGroupManagers/gke-scrap-masters-preempt-pool-91470025-grp",
            ] -> (known after apply)
          ~ managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/beta/projects/scrapmasters/zones/europe-central2-a/instanceGroups/gke-scrap-masters-preempt-pool-91470025-grp",
            ] -> (known after apply)
          ~ max_pods_per_node           = 110 -> (known after apply)
          ~ name                        = "preempt-pool" -> (known after apply)
          + name_prefix                 = (known after apply)
          ~ node_count                  = 1 -> (known after apply)
          ~ node_locations              = [
              - "europe-central2-a",
            ] -> (known after apply)
          ~ version                     = "1.22.12-gke.2300" -> (known after apply)

          ~ autoscaling {
              + location_policy      = (known after apply)
              ~ max_node_count       = 1 -> (known after apply)
              ~ min_node_count       = 1 -> (known after apply)
              ~ total_max_node_count = 0 -> (known after apply)
              ~ total_min_node_count = 0 -> (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = false -> (known after apply)
            }

          ~ network_config {
              ~ create_pod_range    = false -> (known after apply)
              ~ pod_ipv4_cidr_block = "10.0.0.0/16" -> (known after apply)
              ~ pod_range           = "gke-scrap-masters-pods-31a06afa" -> (known after apply)
            }

          ~ node_config {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size_gb      = 40 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS_CONTAINERD" -> (known after apply)
              ~ labels            = {} -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ machine_type      = "e2-medium" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                  - "https://www.googleapis.com/auth/service.management.readonly",
                  - "https://www.googleapis.com/auth/servicecontrol",
                  - "https://www.googleapis.com/auth/trace.append",
                ] -> (known after apply)
              ~ preemptible       = true -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ spot              = false -> (known after apply)
              ~ tags              = [] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + reservation_affinity {
                  + consume_reservation_type = (known after apply)
                  + key                      = (known after apply)
                  + values                   = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              ~ workload_metadata_config {
                  ~ mode = "GKE_METADATA" -> (known after apply)
                }
            }

          + placement_policy {
              + type = (known after apply)
            }

          ~ upgrade_settings {
              ~ max_surge       = 1 -> (known after apply)
              ~ max_unavailable = 0 -> (known after apply)
            }
        }

      ~ node_pool_auto_config {
          + network_tags {
              + tags = (known after apply)
            }
        }

      ~ node_pool_defaults {
          + node_config_defaults {
              + gcfs_config {
                  + enabled = (known after apply)
                }
            }
        }

      ~ notification_config {
          ~ pubsub {
              ~ enabled = false -> (known after apply)
              + topic   = (known after apply)

              + filter {
                  + event_type = (known after apply)
                }
            }
        }

      - pod_security_policy_config {
          - enabled = false -> null
        }

      + private_cluster_config {
          + master_ipv4_cidr_block = (known after apply)
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = (known after apply)
            }
        }

      ~ service_external_ips_config {
          ~ enabled = false -> (known after apply)
        }

      + tpu_config {
          + enabled                = (known after apply)
          + ipv4_cidr_block        = (known after apply)
          + use_service_networking = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.certmanager.helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.7.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # module.certmanager.helm_release.clusterissuer will be created
  + resource "helm_release" "clusterissuer" {
      + atomic                     = false
      + chart                      = "./modules/cert-manager/helm"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-issuer"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.ingress-nginx.data.kubernetes_service.nginx_ingress_controller will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx_ingress_controller" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ingress-nginx.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = true
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = true
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                    controller:
                      admissionWebhooks:
                        enabled: false
                      autoscaling:
                        enabled: true
                        minReplicas: 1
                        maxReplicas: 2
                        targetCPUUtilizationPercentage: 75
                        targetMemoryUtilizationPercentage: 75
                      config:
                        use-forwarded-headers: "true"
                      publishService:
                        enabled: "true"
                      resources:
                        limits:
                          cpu: 200m
                          memory: 128Mi
                        requests:
                          cpu: 100m
                          memory: 64Mi
                      service:
                        # loadBalancerIP: ""
                        annotations:
                          service.beta.kubernetes.io/external-traffic: OnlyLocal
                        externalTrafficPolicy: "Local"
                    defaultBackend:
                      service:
                        annotations:
                          kubernetes.io/ingress.class: "nginx"
                          nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                          nginx.ingress.kubernetes.io/from-to-www-redirect: "true"
                          nginx.ingress.kubernetes.io/ssl-redirect: "true"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.3.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.ingress-nginx.kubernetes_namespace.ingress-nginx will be created
  + resource "kubernetes_namespace" "ingress-nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#3259843110`](https://github.com/scrap-masters/infrastructure/actions/runs/3259843110) - commit bac31cdd4b9f7ac717833fc6fd99755efdbd77fb
